MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAMG53N19B/mcu.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* Cortex-M handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset  */
  void* pfnNonMaskableInt_Handler;               /* -14 Non maskable Interrupt, cannot be stopped or preempted  */
  void* pfnHardFault_Handler;                    /* -13 Hard Fault, all classes of Fault     */
  void* pfnMemoryManagement_Handler;             /* -12 Memory Management, MPU mismatch, including Access Violation and No Match  */
  void* pfnBusFault_Handler;                     /* -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault  */
  void* pfnUsageFault_Handler;                   /* -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition  */
  void* pvReservedC9;
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 System Service Call via SVC instruction  */
  void* pfnDebugMonitor_Handler;                 /*  -4 Debug Monitor                        */
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Pendable request for system service  */
  void* pfnSysTick_Handler;                      /*  -1 System Tick Timer                    */

  /* Peripheral handlers */
  void* pfnSUPC_Handler;                         /* 0   SAMG53N19 Supply Controller (SUPC) */
  void* pfnRSTC_Handler;                         /* 1   SAMG53N19 Reset Controller (RSTC) */
  void* pfnRTC_Handler;                          /* 2   SAMG53N19 Real-time Clock (RTC) */
  void* pfnRTT_Handler;                          /* 3   SAMG53N19 Real-time Timer (RTT) */
  void* pfnWDT_Handler;                          /* 4   SAMG53N19 Watchdog Timer (WDT) */
  void* pfnPMC_Handler;                          /* 5   SAMG53N19 Power Management Controller (PMC) */
  void* pfnEFC_Handler;                          /* 6   SAMG53N19 Embedded Flash Controller (EFC) */
  void* pvReserved7;
  void* pfnUART0_Handler;                        /* 8   SAMG53N19 Universal Asynchronous Receiver Transmitter (UART0) */
  void* pfnUART1_Handler;                        /* 9   SAMG53N19 Universal Asynchronous Receiver Transmitter (UART1) */
  void* pvReserved10;
  void* pfnPIOA_Handler;                         /* 11  SAMG53N19 Parallel Input/Output Controller (PIOA) */
  void* pfnPIOB_Handler;                         /* 12  SAMG53N19 Parallel Input/Output Controller (PIOB) */
  void* pfnPDMIC0_Handler;                       /* 13  SAMG53N19 Pulse Density Modulation Interface Controller (PDMIC0) */
  void* pfnUSART_Handler;                        /* 14  SAMG53N19 Universal Synchronous Asynchronous Receiver Transmitter (USART) */
  void* pfnMEM2MEM_Handler;                      /* 15  SAMG53N19 Memory to Memory (MEM2MEM) */
  void* pfnI2SC0_Handler;                        /* 16  SAMG53N19 Inter-IC Sound Controller (I2SC0) */
  void* pfnI2SC1_Handler;                        /* 17  SAMG53N19 Inter-IC Sound Controller (I2SC1) */
  void* pfnPDMIC1_Handler;                       /* 18  SAMG53N19 Pulse Density Modulation Interface Controller (PDMIC1) */
  void* pfnTWI0_Handler;                         /* 19  SAMG53N19 Two-wire Interface High Speed (TWI0) */
  void* pfnTWI1_Handler;                         /* 20  SAMG53N19 Two-wire Interface (TWI1) */
  void* pfnSPI_Handler;                          /* 21  SAMG53N19 Serial Peripheral Interface (SPI) */
  void* pfnTWI2_Handler;                         /* 22  SAMG53N19 Two-wire Interface (TWI2) */
  void* pfnTC0_Handler;                          /* 23  SAMG53N19 Timer Counter (TC0)  */
  void* pfnTC1_Handler;                          /* 24  SAMG53N19 Timer Counter (TC0)  */
  void* pfnTC2_Handler;                          /* 25  SAMG53N19 Timer Counter (TC0)  */
  void* pfnTC3_Handler;                          /* 26  SAMG53N19 Timer Counter (TC1)  */
  void* pfnTC4_Handler;                          /* 27  SAMG53N19 Timer Counter (TC1)  */
  void* pfnTC5_Handler;                          /* 28  SAMG53N19 Timer Counter (TC1)  */
  void* pfnADC_Handler;                          /* 29  SAMG53N19 Analog-to-Digital Converter (ADC) */
} DeviceVectors;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if !defined DONT_USE_PREDEFINED_CORE_HANDLERS

/* CORTEX-M4 core handlers */
void Reset_Handler                 ( void );
void NonMaskableInt_Handler        ( void );
void HardFault_Handler             ( void );
void MemoryManagement_Handler      ( void );
void BusFault_Handler              ( void );
void UsageFault_Handler            ( void );
void SVCall_Handler                ( void );
void DebugMonitor_Handler          ( void );
void PendSV_Handler                ( void );
void SysTick_Handler               ( void );
#endif /* DONT_USE_PREDEFINED_CORE_HANDLERS */

#if !defined DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS

/* Peripherals handlers */
void ADC_Handler                   ( void );
void EFC_Handler                   ( void );
void I2SC0_Handler                 ( void );
void I2SC1_Handler                 ( void );
void MEM2MEM_Handler               ( void );
void PDMIC0_Handler                ( void );
void PDMIC1_Handler                ( void );
void PIOA_Handler                  ( void );
void PIOB_Handler                  ( void );
void PMC_Handler                   ( void );
void RSTC_Handler                  ( void );
void RTC_Handler                   ( void );
void RTT_Handler                   ( void );
void SPI_Handler                   ( void );
void SUPC_Handler                  ( void );
void TC0_Handler                   ( void );
void TC1_Handler                   ( void );
void TC2_Handler                   ( void );
void TC3_Handler                   ( void );
void TC4_Handler                   ( void );
void TC5_Handler                   ( void );
void TWI0_Handler                  ( void );
void TWI1_Handler                  ( void );
void TWI2_Handler                  ( void );
void UART0_Handler                 ( void );
void UART1_Handler                 ( void );
void USART_Handler                 ( void );
void WDT_Handler                   ( void );
#endif /* DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


